LANG = {
    "English": {
        "title": "AgriSphere – Crop Detection 🌱",
        "upload": "Upload your leaf image here (JPG/PNG)",
        "disease": "Disease Detected",
        "remedy": "Recommended Remedy",
        "market": "Crop Market Prices",
        "location": "Select Market Location",
        "crop": "Select Crop",
        "price": "Price"
    },

    "Hindi": {
        "title": "एग्रीस्फियर – फसल रोग पहचान 🌱",
        "upload": "पत्ते की तस्वीर अपलोड करें (JPG/PNG)",
        "disease": "रोग की पहचान",
        "remedy": "अनुशंसित उपचार",
        "market": "फसल बाजार मूल्य",
        "location": "बाजार स्थान चुनें",
        "crop": "फसल चुनें",
        "price": "कीमत"
    },

    "Tamil": {
        "title": "அக்ரிஸ்பியர் – பயிர் நோய் கண்டறிதல் 🌱",
        "upload": "இலை படத்தை பதிவேற்றவும் (JPG/PNG)",
        "disease": "கண்டறியப்பட்ட நோய்",
        "remedy": "பரிந்துரைக்கப்பட்ட தீர்வு",
        "market": "பயிர் சந்தை விலை",
        "location": "சந்தை இடத்தைத் தேர்ந்தெடுக்கவும்",
        "crop": "பயிரைத் தேர்ந்தெடுக்கவும்",
        "price": "விலை"
    }
}
