LANG = {
    "English": {
        "app_title": "AgriSphere 🌱",
        "subtitle": "Smart Crop Disease Detection & Market Insights",
        "tab1": "Crop Disease",
        "tab2": "AI Assistant",
        "tab3": "Market Prices",
        "upload": "Upload leaf image",
        "detected": "Disease detected",
        "remedy": "Recommended Remedy",
        "assistant": "AI Farming Assistant",
        "future": "AI assistant will be enabled in future updates.",
        "market": "Crop Market Prices",
        "location": "Select location",
        "crop": "Select crop",
        "price": "Current price",
        "note": "Prices may vary depending on market conditions"
    },

    "Tamil": {
        "app_title": "அக்ரிஸ்பியர் 🌱",
        "subtitle": "பயிர் நோய் கண்டறிதல் & சந்தை தகவல்",
        "tab1": "பயிர் நோய்",
        "tab2": "AI உதவியாளர்",
        "tab3": "சந்தை விலை",
        "upload": "இலை படத்தை பதிவேற்றவும்",
        "detected": "கண்டறியப்பட்ட நோய்",
        "remedy": "பரிந்துரைக்கப்பட்ட தீர்வு",
        "assistant": "AI விவசாய உதவியாளர்",
        "future": "AI வசதி விரைவில் சேர்க்கப்படும்.",
        "market": "பயிர் சந்தை விலை",
        "location": "இடத்தை தேர்வு செய்க",
        "crop": "பயிரை தேர்வு செய்க",
        "price": "தற்போதைய விலை",
        "note": "சந்தை நிலவரத்தைப் பொறுத்து விலை மாறலாம்"
    },

    "Hindi": {
        "app_title": "एग्रीस्फियर 🌱",
        "subtitle": "फसल रोग पहचान और बाजार जानकारी",
        "tab1": "फसल रोग",
        "tab2": "AI सहायक",
        "tab3": "बाजार मूल्य",
        "upload": "पत्ती की छवि अपलोड करें",
        "detected": "पाया गया रोग",
        "remedy": "अनुशंसित उपचार",
        "assistant": "AI कृषि सहायक",
        "future": "AI सुविधा जल्द ही उपलब्ध होगी।",
        "market": "फसल बाजार मूल्य",
        "location": "स्थान चुनें",
        "crop": "फसल चुनें",
        "price": "वर्तमान मूल्य",
        "note": "बाजार के अनुसार मूल्य बदल सकता है"
    }
}
